Конвертация_данных_31_демо.Conversion_3_Plus/src/DataProcessors/ЗагрузкаСтруктурыКонфигурацииИзФайловXML/ЗагрузкаСтруктурыКонфигурацииИзФайловXML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="84820387-a043-4a56-9ac6-78a5944e468e">
  <name>ЗагрузкаСтруктурыКонфигурацииИзФайловXML</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

Конвертация_данных_31_демо.Conversion_3_Plus/src/InformationRegisters/Расш1_ТекстыМодулей/Расш1_ТекстыМодулей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расш1_ТекстыМодулей</name>
  <comment>Тексты модулей релиза для подсказок консоли</comment>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Глобальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.Релизы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.Расш1_ВидыМодулей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конвертация_данных_31_демо.Conversion_3_Plus/src/Enums/Расш1_ВидыМодулей/Расш1_ВидыМодулей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Расш1_ВидыМодулей</name>
  <comment>Вид текста модуля конфигурации.</comment>
  <enumValues>
    <name>ОбщийМодуль</name>
  </enumValues>
  <enumValues>
    <name>МодульМенеджера</name>
  </enumValues>
  <enumValues>
    <name>МодульОбъекта</name>
  </enumValues>
</mdclass:Enum>

Конвертация_данных_31_демо.Conversion_3_Plus/src/DataProcessors/ЗагрузкаСтруктурыКонфигурацииИзФайловXML/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&Перед("ВыполнитьЗагрузкуМетаданных")
Процедура Расш1_ВыполнитьЗагрузкуМетаданных(ОбщиеПеременные, АдресВременногоХранилища)
	
	Если Расш1_ПропуститьЧтениеМодулей(ОбщиеПеременные) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеПеременные.Вставить("Расш1_ТекстыМодулей", Расш1_ТекстыМодулейИзФайлов(ОбщиеПеременные.ПомещенныеФайлы));
	
КонецПроцедуры

&После("ВыполнитьЗагрузкуМетаданных")
Процедура Расш1_ВыполнитьЗагрузкуМетаданныхПосле(ОбщиеПеременные, АдресВременногоХранилища)
	
	Если Расш1_ПропуститьЧтениеМодулей(ОбщиеПеременные) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщиеПеременные.Свойство("Отказ") И ОбщиеПеременные.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыМодулей = Неопределено;
	Если Не ОбщиеПеременные.Свойство("Расш1_ТекстыМодулей", ТекстыМодулей) Тогда
		Возврат;
	КонецЕсли;
	
	Релиз = ОбщиеПеременные.Конфигурация;
	Если Не ЗначениеЗаполнено(Релиз) Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_ЗаписатьТекстыМодулей(Релиз, ТекстыМодулей);
	
КонецПроцедуры

Функция Расш1_ПропуститьЧтениеМодулей(ОбщиеПеременные)
	
	Если Не ОбщиеПеременные.Свойство("ПомещенныеФайлы") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ОбщиеПеременные.Свойство("ТолькоОбновитьПланыОбмена")
		И ОбщиеПеременные.ТолькоОбновитьПланыОбмена = Истина;
	
КонецФункции

Функция Расш1_ТекстыМодулейИзФайлов(ПомещенныеФайлы)
	
	ГлобальныеМодули = Расш1_ГлобальныеОбщиеМодули(ПомещенныеФайлы);
	МодулиКонфигурации = Новый Соответствие;
	МодулиРасширения = Новый Соответствие;
	
	Для Каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
		
		ОписаниеМодуля = Расш1_ОписаниеМодуляПоИмениФайла(ПомещенныйФайл.ПолноеИмя);
		Если ОписаниеМодуля = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстМодуля = Расш1_ПрочитатьТекстФайла(ПомещенныйФайл.Хранение);
		Если ПустаяСтрока(ТекстМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеМодуля.Вставить("Текст", ТекстМодуля);
		ОписаниеМодуля.Вставить("Глобальный",
			ГлобальныеМодули.Получить(НРег(ОписаниеМодуля.Ключ)) = Истина);
		
		Если Расш1_ЭтоФайлРасширения(ПомещенныйФайл) Тогда
			МодулиРасширения.Вставить(ОписаниеМодуля.Идентификатор, ОписаниеМодуля);
		Иначе
			МодулиКонфигурации.Вставить(ОписаниеМодуля.Идентификатор, ОписаниеМодуля);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого МодульРасширения Из МодулиРасширения Цикл
		МодулиКонфигурации.Вставить(МодульРасширения.Ключ, МодульРасширения.Значение);
	КонецЦикла;
	
	ТекстыМодулей = Новый Массив;
	Для Каждого МодульКонфигурации Из МодулиКонфигурации Цикл
		ТекстыМодулей.Добавить(МодульКонфигурации.Значение);
	КонецЦикла;
	
	Возврат ТекстыМодулей;
	
КонецФункции

Функция Расш1_ГлобальныеОбщиеМодули(ПомещенныеФайлы)
	
	ГлобальныеМодули = Новый Соответствие;
	
	Для Каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
		
		ИмяМодуля = Расш1_ИмяОбщегоМодуляИзОписания(ПомещенныйФайл.ПолноеИмя);
		Если ПустаяСтрока(ИмяМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстОписания = Расш1_ПрочитатьТекстФайла(ПомещенныйФайл.Хранение);
		ТекстОписанияНРег = НРег(ТекстОписания);
		Если СтрНайти(ТекстОписанияНРег, "<global>true") = 0
			И СтрНайти(ТекстОписанияНРег, "global=""true""") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ГлобальныеМодули.Вставить(ИмяМодуля, Истина);
		
	КонецЦикла;
	
	Возврат ГлобальныеМодули;
	
КонецФункции

Функция Расш1_ИмяОбщегоМодуляИзОписания(ПолноеИмя)
	
	ЧастиПути = Расш1_ЧастиПутиФайла(ПолноеИмя);
	КоличествоЧастей = ЧастиПути.Количество();
	Если КоличествоЧастей < 2 Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяФайла = ЧастиПути[КоличествоЧастей - 1];
	ИмяФайлаНРег = НРег(ИмяФайла);
	
	Если СтрЗаканчиваетсяНа(ИмяФайлаНРег, ".xml") Тогда
		ИмяКаталога = НРег(ЧастиПути[КоличествоЧастей - 2]);
		Если ИмяКаталога <> "commonmodules" И ИмяКаталога <> "общиемодули" Тогда
			Возврат "";
		КонецЕсли;
		Возврат НРег(Лев(ИмяФайла, СтрДлина(ИмяФайла) - 4));
	КонецЕсли;
	
	Если Не СтрЗаканчиваетсяНа(ИмяФайлаНРег, ".mdo") Или КоличествоЧастей < 3 Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяБезРасширения = НРег(Лев(ИмяФайла, СтрДлина(ИмяФайла) - 4));
	Если ИмяБезРасширения <> НРег(ЧастиПути[КоличествоЧастей - 2]) Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяКаталога = НРег(ЧастиПути[КоличествоЧастей - 3]);
	Если ИмяКаталога <> "commonmodules" И ИмяКаталога <> "общиемодули" Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ИмяБезРасширения;
	
КонецФункции

Функция Расш1_ОписаниеМодуляПоИмениФайла(ПолноеИмя)
	
	ЧастиПути = Расш1_ЧастиПутиФайла(ПолноеИмя);
	КоличествоЧастей = ЧастиПути.Количество();
	Если КоличествоЧастей < 3 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяФайла = НРег(ЧастиПути[КоличествоЧастей - 1]);
	ВидМодуля = Расш1_ВидМодуляПоИмениФайла(ИмяФайла);
	Если ВидМодуля = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексКаталога = Расш1_ИндексКаталогаКоллекции(ЧастиПути, ВидМодуля);
	Если ИндексКаталога < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяОбъекта = ЧастиПути[ИндексКаталога + 1];
	Если Не Расш1_ЭтоКореньМодуля(ЧастиПути, ИндексКаталога + 2, ИмяФайла) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВидМодуля = Перечисления.Расш1_ВидыМодулей.ОбщийМодуль Тогда
		Ключ = ИмяОбъекта;
	Иначе
		ИмяКоллекции = Расш1_ИмяКоллекцииПоКаталогу(ЧастиПути[ИндексКаталога]);
		Если ПустаяСтрока(ИмяКоллекции) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Ключ = ИмяКоллекции + "." + ИмяОбъекта;
	КонецЕсли;
	
	Если СтрДлина(Ключ) > 150 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеМодуля = Новый Структура;
	ОписаниеМодуля.Вставить("Вид", ВидМодуля);
	ОписаниеМодуля.Вставить("Ключ", Ключ);
	ОписаниеМодуля.Вставить("Идентификатор", Строка(ВидМодуля) + "|" + НРег(Ключ));
	
	Возврат ОписаниеМодуля;
	
КонецФункции

Функция Расш1_ВидМодуляПоИмениФайла(ИмяФайла)
	
	Если ИмяФайла = "module.bsl" Тогда
		Возврат Перечисления.Расш1_ВидыМодулей.ОбщийМодуль;
	ИначеЕсли ИмяФайла = "managermodule.bsl" Тогда
		Возврат Перечисления.Расш1_ВидыМодулей.МодульМенеджера;
	ИначеЕсли ИмяФайла = "objectmodule.bsl" Тогда
		Возврат Перечисления.Расш1_ВидыМодулей.МодульОбъекта;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция Расш1_ИндексКаталогаКоллекции(ЧастиПути, ВидМодуля)
	
	ИндексФайла = ЧастиПути.Количество() - 1;
	Для Индекс = 0 По ИндексФайла - 2 Цикл
		
		ИмяКаталога = НРег(ЧастиПути[Индекс]);
		ЭтоОбщиеМодули = ИмяКаталога = "commonmodules" Или ИмяКаталога = "общиемодули";
		Если ВидМодуля = Перечисления.Расш1_ВидыМодулей.ОбщийМодуль Тогда
			Если ЭтоОбщиеМодули Тогда
				Возврат Индекс;
			КонецЕсли;
		ИначеЕсли Не ЭтоОбщиеМодули И Не ПустаяСтрока(Расш1_ИмяКоллекцииПоКаталогу(ЧастиПути[Индекс])) Тогда
			Возврат Индекс;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат -1;
	
КонецФункции

Функция Расш1_ЭтоКореньМодуля(ЧастиПути, ИндексНачала, ИмяФайла)
	
	Остаток = Новый Массив;
	Для Индекс = ИндексНачала По ЧастиПути.Количество() - 1 Цикл
		Остаток.Добавить(НРег(ЧастиПути[Индекс]));
	КонецЦикла;
	
	ПутьОстатка = СтрСоединить(Остаток, "/");
	Если ИмяФайла = "module.bsl" Тогда
		Возврат ПутьОстатка = "module.bsl" Или ПутьОстатка = "ext/module.bsl";
	КонецЕсли;
	
	Возврат ПутьОстатка = ИмяФайла Или ПутьОстатка = "ext/" + ИмяФайла;
	
КонецФункции

Функция Расш1_ИмяКоллекцииПоКаталогу(ИмяКаталога)
	
	ИменаКоллекций = Расш1_ИменаКоллекцийПоКаталогам();
	ИмяКоллекции = ИменаКоллекций[НРег(ИмяКаталога)];
	Если ИмяКоллекции = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ИмяКоллекции;
	
КонецФункции

Функция Расш1_ИменаКоллекцийПоКаталогам()
	
	ИменаКоллекций = Новый Соответствие;
	ИменаКоллекций.Вставить("catalogs", "справочники");
	ИменаКоллекций.Вставить("справочники", "справочники");
	ИменаКоллекций.Вставить("documents", "документы");
	ИменаКоллекций.Вставить("документы", "документы");
	ИменаКоллекций.Вставить("informationregisters", "регистрысведений");
	ИменаКоллекций.Вставить("регистрысведений", "регистрысведений");
	ИменаКоллекций.Вставить("accumulationregisters", "регистрынакопления");
	ИменаКоллекций.Вставить("регистрынакопления", "регистрынакопления");
	ИменаКоллекций.Вставить("accountingregisters", "регистрыбухгалтерии");
	ИменаКоллекций.Вставить("регистрыбухгалтерии", "регистрыбухгалтерии");
	ИменаКоллекций.Вставить("calculationregisters", "регистрырасчета");
	ИменаКоллекций.Вставить("регистрырасчета", "регистрырасчета");
	ИменаКоллекций.Вставить("dataprocessors", "обработки");
	ИменаКоллекций.Вставить("обработки", "обработки");
	ИменаКоллекций.Вставить("reports", "отчеты");
	ИменаКоллекций.Вставить("отчеты", "отчеты");
	ИменаКоллекций.Вставить("enums", "перечисления");
	ИменаКоллекций.Вставить("перечисления", "перечисления");
	ИменаКоллекций.Вставить("chartsofaccounts", "планысчетов");
	ИменаКоллекций.Вставить("планысчетов", "планысчетов");
	ИменаКоллекций.Вставить("businessprocesses", "бизнеспроцессы");
	ИменаКоллекций.Вставить("бизнеспроцессы", "бизнеспроцессы");
	ИменаКоллекций.Вставить("tasks", "задачи");
	ИменаКоллекций.Вставить("задачи", "задачи");
	ИменаКоллекций.Вставить("exchangeplans", "планыобмена");
	ИменаКоллекций.Вставить("планыобмена", "планыобмена");
	ИменаКоллекций.Вставить("chartsofcharacteristictypes", "планывидовхарактеристик");
	ИменаКоллекций.Вставить("планывидовхарактеристик", "планывидовхарактеристик");
	ИменаКоллекций.Вставить("chartsofcalculationtypes", "планывидоврасчета");
	ИменаКоллекций.Вставить("планывидоврасчета", "планывидоврасчета");
	ИменаКоллекций.Вставить("constants", "константы");
	ИменаКоллекций.Вставить("константы", "константы");
	
	Возврат ИменаКоллекций;
	
КонецФункции

Функция Расш1_ЧастиПутиФайла(ПолноеИмя)
	
	Путь = СтрЗаменить(ПолноеИмя, "\", "/");
	Возврат СтрРазделить(Путь, "/", Ложь);
	
КонецФункции

Функция Расш1_ЭтоФайлРасширения(ПомещенныйФайл)
	
	Возврат ПомещенныйФайл.Свойство("ЭтоРасширение") И ПомещенныйФайл.ЭтоРасширение = Истина;
	
КонецФункции

Функция Расш1_ПрочитатьТекстФайла(ИмяФайла)
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат "";
	КонецЕсли;
	
	Текст = "";
	Попытка
		Чтение = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
		Текст = Чтение.Прочитать();
		Чтение.Закрыть();
	Исключение
		Возврат "";
	КонецПопытки;
	
	Если Текст = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Процедура Расш1_ЗаписатьТекстыМодулей(Релиз, ТекстыМодулей)
	
	НаборЗаписей = РегистрыСведений.Расш1_ТекстыМодулей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Релиз.Установить(Релиз);
	
	Для Каждого ОписаниеМодуля Из ТекстыМодулей Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Релиз = Релиз;
		Запись.Вид = ОписаниеМодуля.Вид;
		Запись.Ключ = ОписаниеМодуля.Ключ;
		Запись.Текст = ОписаниеМодуля.Текст;
		Запись.Глобальный = ОписаниеМодуля.Глобальный;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
